app/controllers/elements_controller.rb

  def index
    @elements = Element.all
---
SELECT * FROM "elements" ORDER BY position

  def show
    @element = Element.find(params[:id])
---
SELECT * FROM "elements" WHERE ("elements"."id" = 1) ORDER BY position

  def edit
    @element = Element.find(params[:id])
---
SELECT * FROM "elements" WHERE (id = 1 or ancestry like '1/%' or ancestry = '1') ORDER BY position

  def create
    @element = Element.new(params[:element])

    respond_to do |format|
      if @element.save
---
INSERT INTO "elements" ("name", "position", "created_at", "ancestry", "updated_at", "type", "ancestry_depth") VALUES('Root', NULL, '2010-06-15 12:59:58', '', '2010-06-15 12:59:58', NULL, 0)

  def update
    @element = Element.find(params[:id])

    respond_to do |format|
      if @element.update_attributes(params[:element])
---
SELECT * FROM "elements" WHERE ("elements"."id" = 2) ORDER BY position
UPDATE "elements" SET "updated_at" = '2010-06-15 13:31:24', "name" = 'First Level Item 1' WHERE "id" = 4

  def destroy
    @element = Element.find(params[:id])
    @element.destroy
---
SELECT * FROM "elements" WHERE (ancestry like '2/%' or ancestry = '2') ORDER BY position
DELETE FROM "elements" WHERE "id" = 2